zlgopen/ametal/soc/hdsc/drivers/include/can/hw/amhw_hc32f460_can.h
}stc_can_rxframe_t;


typedef enum
{
    //<<Can Tx or Tx Irq Flg
    CanTxBufFullIrqFlg          = 0x00000001,   ///<
    CanRxIrqFlg                 = 0x00008000,   ///< Receive interrupt flag
    CanRxOverIrqFlg             = 0x00004000,   ///< RB overrun interrupt flag
    CanRxBufFullIrqFlg          = 0x00002000,   ///< RB full interrupt flag
    CanRxBufAlmostFullIrqFlg    = 0x00001000,   ///< RB almost full interrupt flag
    CanTxPrimaryIrqFlg          = 0x00000800,   ///< Transmission primary interrupt flag
    CanTxSecondaryIrqFlg        = 0x00000400,   ///< Transmission secondary interrupt flag
    CanErrorIrqFlg              = 0x00000200,   ///< Error interrupt flag
    CanAbortIrqFlg              = 0x00000100,   ///< Abort interrupt flag

    //<< Can Error Irq Flg
    CanErrorWarningIrqFlg       = 0x00800000,   ///< Error warning limit reached flag
    CanErrorPassivenodeIrqFlg   = 0x00400000,   ///< Error passive mode active flag
    CanErrorPassiveIrqFlg       = 0x00100000,   ///< Error passive interrupt flag
    CanArbiLostIrqFlg           = 0x00040000,   ///< Arbitration lost interrupt flag
    CanBusErrorIrqFlg           = 0x00010000,   ///< Bus error interrupt flag
}en_can_irq_flag_type_t;

typedef enum
{
    //<<Can Rx or Tx Irq En
    CanRxIrqEn              = 0x00000080,   ///< Receive interrupt enable
    CanRxOverIrqEn          = 0x00000040,   ///< RB overrun interrupt enable
    CanRxBufFullIrqEn       = 0x00000020,   ///< RB full interrupt enable
    CanRxBufAlmostFullIrqEn = 0x00000010,   ///< RB almost full interrupt enable
    CanTxPrimaryIrqEn       = 0x00000008,   ///< Transmission primary interrupt enable
    CanTxSecondaryIrqEn     = 0x00000004,   ///< Transmission secondary enable
    CanErrorIrqEn           = 0x00000002,   ///< Error interrupt enable

    //<<Can Error Irq En
    CanErrorPassiveIrqEn    = 0x00200000,   ///< Error passive mode active enable
    CanArbiLostIrqEn        = 0x00080000,   ///< Arbitration lost interrupt enable
    CanBusErrorIrqEn        = 0x00020000,   ///< Bus error interrupt enable

}en_can_irq_type_t;

typedef enum en_can_filter_sel
{
    CanFilterSel1        = 0u,   ///< The Acceptance Filter 1 Enable
    CanFilterSel2        = 1u,   ///< The Acceptance Filter 2 Enable
    CanFilterSel3        = 2u,   ///< The Acceptance Filter 3 Enable
    CanFilterSel4        = 3u,   ///< The Acceptance Filter 4 Enable
    CanFilterSel5        = 4u,   ///< The Acceptance Filter 5 Enable
    CanFilterSel6        = 5u,   ///< The Acceptance Filter 6 Enable
    CanFilterSel7        = 6u,   ///< The Acceptance Filter 7 Enable
    CanFilterSel8        = 7u,   ///< The Acceptance Filter 8 Enable
}en_can_filter_sel_t;

typedef enum en_can_acf_format_en
{
    CanStdFrames        = 0x02u,   ///< Accepts only Standard frames
    CanExtFrames        = 0x03u,   ///< Accepts only Extended frames
    CanAllFrames        = 0x00u,   ///< Accepts both standard or extended frames
}en_can_acf_format_en_t;

typedef struct stc_can_filter
{
    uint32_t                u32CODE;        ///< Acceptance CODE
    uint32_t                u32MASK;        ///< Acceptance MASK
    en_can_filter_sel_t     enFilterSel;    ///< The Acceptance Filters Enable
    en_can_acf_format_en_t  enAcfFormat;    ///< The Acceptance Filters Frame Format Check.
}stc_can_filter_t;

typedef enum
{
    NO_ERROR        = 0U,
    BIT_ERROR       = 1U,
    FORM_ERROR      = 2U,
    STUFF_ERROR     = 3U,
    ACK_ERROR       = 4U,
    CRC_ERROR       = 5U,
    UNKOWN_ERROR    = 6U,
}en_can_error_t;

typedef enum
{
    CanRxActive = 0x04,        ///< Reception active
    CanTxActive = 0x02,        ///< Transmission active
    CanBusoff   = 0x01,        ///< Bus off
}en_can_status_t;

am_static_inline
void amhw_hc32f460_can_mode_config(amhw_hc32f460_can_t *p_hw_can, en_can_mode_t enMode, en_can_functional_state_t enNewState)
{
    if(CanListenOnlyMode == enMode)
    {
        p_hw_can->TCMD_f.LOM = enNewState;
    }else
    {
        if(CanEnable == enNewState)
        {
            p_hw_can->CFG_STAT |= enMode;
        }else
        {
            p_hw_can->CFG_STAT &= ~enMode;
        }
    }
}

#define CAN_RESET_ENABLE(p_hw_can)       (p_hw_can->CFG_STAT_f.RESET = 1u)
#define CAN_RESET_DISABLE(p_hw_can)                                                     \
do{                                                                             \
    do{                                                                         \
        p_hw_can->CFG_STAT_f.RESET = 0u;                                          \
    }while(p_hw_can->CFG_STAT_f.RESET);                                               \
}while(0)

am_static_inline
void amhw_hc32f460_can_lowlevel_set(amhw_hc32f460_can_t *p_hw_can, stc_can_init_config_t *pstcCanInitCfg)
{
    if (NULL != pstcCanInitCfg)
    {
        p_hw_can->RCTRL_f.SACK   = pstcCanInitCfg->enCanSAck;
        p_hw_can->TCTRL_f.TSMODE = pstcCanInitCfg->enCanSTBMode;
        p_hw_can->RCTRL_f.RBALL  = pstcCanInitCfg->enCanRxBufAll;
        p_hw_can->RCTRL_f.ROM    = pstcCanInitCfg->enCanRxBufMode;

        p_hw_can->RTIE = 0x00u;

        CAN_RESET_ENABLE(p_hw_can);

        p_hw_can->BT_f.PRESC = pstcCanInitCfg->stcCanBt.PRESC;
        p_hw_can->BT_f.SEG_1 = pstcCanInitCfg->stcCanBt.SEG_1;
        p_hw_can->BT_f.SEG_2 = pstcCanInitCfg->stcCanBt.SEG_2;
        p_hw_can->BT_f.SJW   = pstcCanInitCfg->stcCanBt.SJW;

        p_hw_can->LIMIT_f.AFWL = pstcCanInitCfg->stcWarningLimit.CanWarningLimitVal;
        p_hw_can->LIMIT_f.EWL  = pstcCanInitCfg->stcWarningLimit.CanErrorWarningLimitVal;

        CAN_RESET_DISABLE(p_hw_can);
    }
}

am_static_inline
void amhw_hc32f460_can_lowlevel_get(amhw_hc32f460_can_t *p_hw_can, stc_can_init_config_t *pstcCanInitCfg)
{
    if (NULL != pstcCanInitCfg)
    {
        pstcCanInitCfg->enCanSAck      = p_hw_can->RCTRL_f.SACK;
        pstcCanInitCfg->enCanSTBMode   = p_hw_can->TCTRL_f.TSMODE;
        pstcCanInitCfg->enCanRxBufAll  = p_hw_can->RCTRL_f.RBALL;
        pstcCanInitCfg->enCanRxBufMode = p_hw_can->RCTRL_f.ROM;

        p_hw_can->RTIE = 0x00u;

        CAN_RESET_ENABLE(p_hw_can);

        pstcCanInitCfg->stcCanBt.PRESC = p_hw_can->BT_f.PRESC;
        pstcCanInitCfg->stcCanBt.SEG_1 = p_hw_can->BT_f.SEG_1;
        pstcCanInitCfg->stcCanBt.SEG_2 = p_hw_can->BT_f.SEG_2;
        pstcCanInitCfg->stcCanBt.SJW   = p_hw_can->BT_f.SJW;

        pstcCanInitCfg->stcWarningLimit.CanWarningLimitVal       = p_hw_can->LIMIT_f.AFWL;
        pstcCanInitCfg->stcWarningLimit.CanErrorWarningLimitVal  = p_hw_can->LIMIT_f.EWL;

        CAN_RESET_DISABLE(p_hw_can);
    }
}


am_static_inline
uint8_t amhw_hc32f460_can_rx_error_cnt_get(amhw_hc32f460_can_t *p_hw_can)
{
    return p_hw_can->RECNT;
}

am_static_inline
void amhw_hc32f460_can_rx_error_cnt_clr(amhw_hc32f460_can_t *p_hw_can)
{
    p_hw_can->RECNT = 0;
}

am_static_inline
uint8_t amhw_hc32f460_can_tx_error_cnt_get(amhw_hc32f460_can_t *p_hw_can)
{
    return p_hw_can->TECNT;
}

am_static_inline
void amhw_hc32f460_can_tx_error_cnt_clr(amhw_hc32f460_can_t *p_hw_can)
{
    p_hw_can->TECNT = 0;
}

am_static_inline
void amhw_hc32f460_can_set_frame(amhw_hc32f460_can_t *p_hw_can, stc_can_txframe_t *pstcTxFrame)
{
    if(NULL != pstcTxFrame)
    {
        p_hw_can->TCMD_f.TBSEL = pstcTxFrame->enBufferSel;
        p_hw_can->TBUF0 = pstcTxFrame->TBUF32_0;
        p_hw_can->TBUF1 = pstcTxFrame->TBUF32_1;
        p_hw_can->TBUF2 = pstcTxFrame->TBUF32_2[0];
        p_hw_can->TBUF3 = pstcTxFrame->TBUF32_2[1];

