zlgopen/ametal/soc/hdsc/drivers/include/can/hw/amhw_hc32f460_can.h
        if(CanSTBSel == pstcTxFrame->enBufferSel)
        {
            p_hw_can->TCTRL_f.TSNEXT = CanEnable;
        }
    }
}

am_static_inline
en_can_tx_buf_status_t amhw_hc32f460_can_transmit_cmd(amhw_hc32f460_can_t *p_hw_can, en_can_tx_cmd_t enTxCmd)
{
    p_hw_can->TCMD |= enTxCmd;

    return (en_can_tx_buf_status_t)p_hw_can->TCTRL_f.TSSTAT;

}

am_static_inline
en_can_rx_buf_status_t amhw_hc32f460_can_receive(amhw_hc32f460_can_t *p_hw_can, stc_can_rxframe_t *pstcRxFrame)
{
    if(NULL != pstcRxFrame)
    {
        pstcRxFrame->RBUF32_0    = p_hw_can->RBUF0;
        pstcRxFrame->RBUF32_1    = p_hw_can->RBUF1;
        pstcRxFrame->RBUF32_2[0] = p_hw_can->RBUF2;
        pstcRxFrame->RBUF32_2[1] = p_hw_can->RBUF3;

        p_hw_can->RCTRL_f.RREL = 1u;
    }
    return (en_can_rx_buf_status_t)p_hw_can->RCTRL_f.RSSTAT;
}

am_static_inline
am_bool_t amhw_hc32f460_can_irq_flag_get(amhw_hc32f460_can_t *p_hw_can, en_can_irq_flag_type_t enCanIrqFlgType)
{
    volatile uint32_t *u32pIE = NULL;
    am_bool_t bRet = AM_FALSE;

    u32pIE = (volatile uint32_t*)(&p_hw_can->RTIE);
    if( *u32pIE & enCanIrqFlgType)
    {
        bRet = AM_TRUE;
    }
    return bRet;
}

am_static_inline
uint8_t amhw_hc32f460_can_int_status_get(amhw_hc32f460_can_t *p_hw_can)
{    
   return p_hw_can->RTIF;
}

am_static_inline
uint8_t  amhw_hc32f460_can_status_get(amhw_hc32f460_can_t *p_hw_can, en_can_status_t enCanStatus)
{
    am_bool_t bRet = AM_FALSE;

    if(p_hw_can->CFG_STAT & enCanStatus)
    {
        bRet = AM_TRUE;
    }
    return bRet;
}


am_static_inline
void amhw_hc32f460_can_irq_flag_clr(amhw_hc32f460_can_t *p_hw_can, en_can_irq_flag_type_t enCanIrqFlgType)
{
    volatile uint32_t *u32pIE = NULL;

    u32pIE = (volatile uint32_t*)(&p_hw_can->RTIE);

    *u32pIE |= enCanIrqFlgType;
}

am_static_inline
void amhw_hc32f460_can_irq_cmd(amhw_hc32f460_can_t *p_hw_can, en_can_irq_type_t enCanIrqType, en_can_functional_state_t enNewState)
{
    volatile uint32_t *u32pIE;

    u32pIE = (volatile uint32_t*)(&p_hw_can->RTIE);

    if(CanEnable == enNewState)
    {
        *u32pIE |= enCanIrqType;
    }else
    {
        *u32pIE &= ~((uint32_t)enCanIrqType);
    }

}

#define CAN_ACF_ID_REG_SEL                  ((uint8_t)0x00u)
#define CAN_ACF_MASK_REG_SEL                ((uint8_t)0x01u)

am_static_inline
void amhw_hc32f460_can_filter_config(amhw_hc32f460_can_t *p_hw_can, const stc_can_filter_t *pstcFilter, en_can_functional_state_t enNewState)
{
    if(NULL != pstcFilter)
    {
        CAN_RESET_ENABLE(p_hw_can);

        //<<Acceptance filter address
        p_hw_can->ACFCTRL_f.ACFADR  = pstcFilter->enFilterSel;

        //<<ID config
        p_hw_can->ACFCTRL_f.SELMASK = CAN_ACF_ID_REG_SEL;
        p_hw_can->ACF               = pstcFilter->u32CODE;

        //<<MASK config
        p_hw_can->ACFCTRL_f.SELMASK = CAN_ACF_MASK_REG_SEL;
        p_hw_can->ACF               = pstcFilter->u32MASK;

        //<<Frame format config
        p_hw_can->ACF_f.AIDEE = ((pstcFilter->enAcfFormat >> 1ul) & 0x01u);
        p_hw_can->ACF_f.AIDE  = (pstcFilter->enAcfFormat & 0x01ul);

        if(CanEnable == enNewState)
        {
            p_hw_can->ACFEN |= (uint8_t)(1ul << pstcFilter->enFilterSel);
        }else
        {
            p_hw_can->ACFEN &= (uint8_t)(~(1ul << (pstcFilter->enFilterSel)));
        }

        CAN_RESET_DISABLE(p_hw_can);
    }
}

am_static_inline
en_can_error_t amhw_hc32f460_can_error_status_get(amhw_hc32f460_can_t *p_hw_can)
{
    en_can_error_t enRet = UNKOWN_ERROR;

    if(6u > p_hw_can->EALCAP_f.KOER)
    {
        enRet = (en_can_error_t)p_hw_can->EALCAP_f.KOER;
    }
    return enRet;

}

/**
 * @} amhw_hc32f460_if_can
 */

#ifdef __cplusplus
}
#endif

#endif /* __AMHW_HC32F460_CAN_H */

/* end of file */
